### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_service.service will be created
  + resource "google_cloud_run_v2_service" "service" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west1"
      + name                    = "django-demo"
      + observed_generation     = (known after apply)
      + project                 = "gothic-guard-485708-c1"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + scaling (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "sa-cloudrun-django@gothic-guard-485708-c1.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "europe-west1-docker.pkg.dev/gothic-guard-485708-c1/demo/django-demo:3f86bcd1aef7d46518cc04c56f5062dedd9f4c6d"

              + env {
                  + name  = "DJANGO_SETTINGS_MODULE"
                  + value = "app.settings"
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                }

              + startup_probe (known after apply)
            }

          + scaling (known after apply)
        }

      + traffic (known after apply)
    }

  # google_cloud_run_v2_service_iam_member.public will be created
  + resource "google_cloud_run_v2_service_iam_member" "public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "allUsers"
      + name     = "django-demo"
      + project  = "gothic-guard-485708-c1"
      + role     = "roles/run.invoker"
    }

  # google_service_account.run_sa will be created
  + resource "google_service_account" "run_sa" {
      + account_id   = "sa-cloudrun-django"
      + disabled     = false
      + display_name = "Cloud Run runtime SA"
      + email        = "sa-cloudrun-django@gothic-guard-485708-c1.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:sa-cloudrun-django@gothic-guard-485708-c1.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "gothic-guard-485708-c1"
      + unique_id    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + service_url = (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "logging" but a value was

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "service_accounts" but a

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 9 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `failure`

*Pusher: @Khagou, Action: `pull_request`, Working Directory: ``, Workflow: `FAST demo-django-setup stage`*